Инвестиции_1С/src/Documents/ДИ_ВводВыводДенежныхСредств/ДИ_ВводВыводДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДИ_ВводВыводДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ДИ_ДенежныеСредстваПортфелей</registerRecords>
  <attributes>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.ДИ_Портфели</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ДИ_ВидОперацииДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Инвестиции_1С/src/AccumulationRegisters/ДИ_ДенежныеСредстваПортфелей/ДИ_ДенежныеСредстваПортфелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДИ_ДенежныеСредстваПортфелей</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.ДИ_Портфели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Инвестиции_1С/src/Enums/ДИ_ВидОперацииДС/ДИ_ВидОперацииДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДИ_ВидОперацииДС</name>
  <enumValues>
    <name>Ввод</name>
  </enumValues>
  <enumValues>
    <name>Вывод</name>
  </enumValues>
</mdclass:Enum>

Инвестиции_1С/src/Documents/ДИ_ВводВыводДенежныхСредств/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДИ_ДенежныеСредстваПортфелей.Записывать = Истина;
	
	Если ВидОперации = Перечисления.ДИ_ВидОперацииДС.Ввод Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе
		ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	
	Запись = Движения.ДИ_ДенежныеСредстваПортфелей.Добавить();
	Запись.ВидДвижения = ВидДвижения;
	Запись.Период = ДатаОперации;
	Запись.Портфель = Портфель;
	Запись.Валюта = Валюта;
	Запись.Сумма = Сумма;
	
КонецПроцедуры


// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
